package lesson

import ru.altmanea.edu.server.model.lesson


val lessonImportList1 = listOf(

    // 29з - верхняя неделя
    lesson( "00","29з","физич.культ.и спорт", "лек.", "1-320","преп.", "Кладов Э.В."),
    lesson( "04","29з","инфоком.системы и сети", "лаб.", "1-325","доц.", "Малютин А.Г."),
    lesson( "03","29з","инженер.инф.сист.", "лаб.", "1-467","доц.", "Каштанов А.Л."),
    lesson( "12","29з","инженер.инф.сист.", "пр.кср.", "1-112","доц.", "Каштанов А.Л."),
    lesson( "13","29з","комп.компл.и сети", "лаб.", "1-329","доц.", "Окишев А.С."),
    lesson( "20","29з","инфоком.системы и сети", "лек.", "1-325","доц.", "Малютин А.Г."),
    lesson( "21","29з","инженер.инф.сист.", "лек.", "1-330","доц.", "Каштанов А.Л."),
    lesson( "30","29з","тестиров.програм.пр.", "лек.", "1-400а","доц.", "Елизаров Д.А."),
    lesson( "31","29з","комп.компл.и сети", "лек.", "1-410","доц.", "Окишев А.С."),
    lesson( "32","29з","тестиров.програм.пр.", "пр.кср.", "1-329","преп.", "Голововин Д.В."),
    lesson( "33","29з","инфоком.системы и сети", "лаб.", "1-325","доц.", "Малютин А.Г."),
    lesson( "34","29з","инфоком.системы и сети", "лаб.", "1-325","доц.", "Малютин А.Г."),
    lesson( "41","29з","тестиров.програм.пр.", "лаб.", "1-467","преп.", "Голововин Д.В."),
    lesson( "42","29з","подг.по раб.проф.", "пр.", "1-322","ст.пр.", "Циркин В.С."),
    lesson( "50","29з","прикладн.програм.", "лек.", "1-112","доц.", "Альтман Е.А."),
    lesson( "51","29з","инфоком.системы и сети", "пр.кср.", "1-433","доц.", "Малютин А.Г."),
    lesson( "53","29з","подг.по раб.проф.", "пр.", "1-322","ст.пр.", "Циркин В.С."),

    // 29з - нижняя неделя
    lesson( "62","29з","инженер.инф.сист.", "пр.", "1-467","доц.", "Каштанов А.Л."),
    lesson( "71","29з","комп.компл.и сети", "лаб.", "1-329","доц.", "Окишев А.С."),
    lesson( "72","29з","инженер.инф.сист.", "лек.", "1-330","доц.", "Каштанов А.Л."),
    lesson( "80","29з","подг.по раб.проф.", "пр.", "1-322","ст.пр.", "Циркин В.С."),
    lesson( "81","29з","тестиров.програм.пр.", "лек.", "1-400а","доц.", "Елизаров Д.А."),
    lesson( "82","29з","тестиров.програм.пр.", "лаб.", "1-467","преп.", "Голововин Д.В."),
    lesson( "83","29з","инфоком.системы и сети", "лек.", "1-112","доц.", "Малютин А.Г."),
    lesson( "84","29з","инфоком.системы и сети", "лаб.", "1-325","доц.", "Малютин А.Г."),
    lesson( "90","29з","прикладн.програм.", "пр.кср.", "1-322","доц.", "Альтман Е.А."),
    lesson( "91","29з","инженер.инф.сист.", "лек.", "1-330","доц.", "Каштанов А.Л."),
    lesson( "101","29з","прикладн.програм.", "лек.", "1-112","доц.", "Альтман Е.А."),
    lesson( "102","29з","прикладн.програм.", "лаб.", "1-326","доц.", "Альтман Е.А."),
    lesson( "110","29з","комп.компл.и сети", "пр.кср.", "1-325","доц.", "Окишев А.С."),
    lesson( "111","29з","подг.по раб.проф.", "пр.", "1-322","ст.пр.", "Циркин В.С."),


    // 29м - верхняя неделя
    lesson( "02","29м","физич.культ.и спорт", "лек.", "1-320","преп.", "Кладов Э.В."),
    lesson( "03","29м","инфоком.системы и сети", "лаб.", "1-275","доц.", "Малютин А.Г."),
    lesson( "12","29м","тестиров.програм.пр.", "лаб.", "1-467","преп.", "Голововин Д.В."),
    lesson( "13","29м","инфоком.системы и сети", "лаб.", "1-325","доц.", "Малютин А.Г."),
    lesson( "20","29м","инфоком.системы и сети", "лек.", "1-325","доц.", "Малютин А.Г."),
    lesson( "21","29м","инженер.инф.сист.", "лек.", "1-330","доц.", "Каштанов А.Л."),
    lesson( "22","29м","прикладн.програм.", "лаб.", "1-326","доц.", "Альтман Е.А."),
    lesson( "23","29м","инженер.инф.сист.", "пр.кср.", "1-112","доц.", "Каштанов А.Л."),
    lesson( "24","29м","инженер.инф.сист.", "лаб.", "1-467","доц.", "Каштанов А.Л."),
    lesson( "30","29м","тестиров.програм.пр.", "лаб.", "1-467","преп.", "Голововин Д.В."),
    lesson( "31","29м","комп.компл.и сети", "лек.", "1-410","доц.", "Окишев А.С."),
    lesson( "40","29м","тестиров.програм.пр.", "лек.", "1-467","преп.", "Голововин Д.В."),
    lesson( "41","29м","физич.культ.и спорт", "лек.", "1-120","преп.", "Кладов Э.В."),
    lesson( "42","29м","тестиров.програм.пр.", "пр.кср.", "1-329","преп.", "Голововин Д.В."),
    lesson( "43","29м","прикладн.програм.", "пр.крб.", "1-275","доц.", "Альтман Е.А."),
    lesson( "50","29м","тестиров.програм.пр.", "лаб.", "1-467","преп.", "Голововин Д.В."),
    lesson( "51","29м","комп.компл.и сети", "лаб.", "1-329","доц.", "Окишев А.С."),

    // 29м - нижняя неделя
    lesson( "61","29м","комп.компл.и сети", "лаб.", "1-329","доц.", "Окишев А.С."),
    lesson( "62","29м","прикладн.програм.", "пр.кср.", "1-433","доц.", "Альтман Е.А."),
    lesson( "72","29м","комп.компл.и сети", "лек.", "1-112","доц.", "Окишев А.С."),
    lesson( "73","29м","комп.компл.и сети", "пр.кср.", "1-325","доц.", "Окишев А.С."),
    lesson( "74","29м","инфоком.системы и сети", "лаб.", "1-325","доц.", "Малютин А.Г."),
    lesson( "83","29м","инфоком.системы и сети", "лек.", "1-112","доц.", "Малютин А.Г."),
    lesson( "84","29м","инженер.инф.сист.", "лаб.", "1-467","доц.", "Каштанов А.Л."),
    lesson( "90","29м","инфоком.системы и сети", "пр.кпр.", "1-216","доц.", "Малютин А.Г."),
    lesson( "91","29м","инженер.инф.сист.", "лек.", "1-330","доц.", "Каштанов А.Л."),
    lesson( "100","29м","прикладн.програм.", "лаб.", "1-326","доц.", "Альтман Е.А."),
    lesson( "101","29м","прикладн.програм.", "лек.", "1-112","доц.", "Альтман Е.А."),
    lesson( "110","29м","тестиров.програм.пр.", "лаб.", "1-467","преп.", "Голововин Д.В."),
    lesson( "111","29м","комп.компл.и сети", "лаб.", "1-329","доц.", "Окишев А.С.")





    )